cask_args appdir: '/Applications'

tap 'homebrew/versions'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'jlhonora/lsusb'

brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'bash-completion2'
brew 'wget', args: ['with-iri']
brew 'python'
brew 'python3'
brew 'openssl'
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'htop-osx'
brew 'nmap'
brew 'node'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tree'
brew 'youtube-dl'
brew 'z'
brew 'pass'
brew 'mas'
brew 'neofetch'
brew 'thefuck'
brew 'speedtest_cli'
brew 'gnupg'
brew 'lsusb'
brew 'stormssh'
brew 'imagemagick'
brew 'go'

cask 'sublime-text'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2-beta'
cask 'appcleaner'
cask 'spotify'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'wireshark'
cask 'spectacle'
cask 'java'
cask 'filezilla'
cask 'atom'
cask 'bartender'
cask 'flux'
cask 'postman'
cask 'grandperspective'
cask 'libreoffice'
cask 'transmission'
cask 'android-file-transfer'
cask 'vlc'
cask 'openemu'
cask 'skyfonts'
cask 'dropbox'
cask 'franz'
cask 'adobe-creative-cloud'
cask 'discord'
cask 'slack'

# fonts
cask 'font-source-code-pro'

mas 'Tweetbot', id: 557168941
mas 'Marked 2', id: 890031187
mas 'Amphetamine', id: 937984704
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Solitaire', id: 515113678
mas 'Numbers', id: 409203825
