cask_args appdir: '/Applications'

tap 'homebrew/versions'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'jlhonora/lsusb'

brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'bash-completion2'
brew 'wget', args: ['with-iri']
brew 'python'
brew 'python3'
brew 'openssl'
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'htop-osx'
brew 'nmap'
brew 'node'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tree'
brew 'youtube-dl'
brew 'z'
brew 'pass'
brew 'mas'
brew 'screenfetch'
brew 'wakeonlan'
brew 'thefuck'
brew 'mongodb'
brew 'speedtest_cli'
brew 'whatmask'
brew 'gnupg'
brew 'lsusb'
brew 'xmlstarlet'
brew 'trang'
brew 'stormssh'
brew 'imagemagick'
brew 'tmux'
brew 'ranger'

cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2-beta'
cask 'appcleaner'
cask 'spotify'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'wireshark'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'hyperdock'
cask 'java'
cask 'netbeans'
cask 'filezilla'
cask 'firefoxdeveloperedition'
cask 'steam'
cask 'teamviewer'
cask 'atom'
cask 'bartender'
cask 'flux'
cask 'fileshuttle'
cask 'postman'
cask 'kid3'
cask 'teamspeak-client'
cask 'grandperspective'
cask 'libreoffice'
cask 'adobe-photoshop-cc'
cask 'adobe-illustrator-cc'
cask 'transmission'
cask 'android-file-transfer'
cask 'vlc'
cask 'scroll-reverser'
cask 'xquartz'
cask 'brackets'
cask 'basex'
cask 'openemu'

# games
cask 'minecraft'

# fonts
cask 'font-source-code-pro'

mas 'Tweetbot', id: 557168941
mas 'Marked 2', id: 890031187
mas 'Amphetamine', id: 937984704
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Solitaire', id: 515113678
mas 'Numbers', id: 409203825
