cask_args appdir: '/Applications'

tap 'homebrew/versions'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'jlhonora/lsusb'
tap 'buo/cask-upgrade'

brew 'bash'
brew 'bash-completion2'

brew 'make', args: ['with-default-names']
brew 'cmake', args: ['HEAD']
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'automake'
brew 'autoconf'
brew 'pkg-config'
brew 'wget'
brew 'python'
brew 'python3'
brew 'openssl'
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'htop-osx'
brew 'nmap'
brew 'node'
brew 'yarn'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tree'
brew 'youtube-dl'
brew 'z'
brew 'pass'
brew 'mas'
brew 'neofetch'
brew 'thefuck'
brew 'speedtest_cli'
brew 'gnupg'
brew 'lsusb'
brew 'imagemagick'
brew 'neovim'
brew 'tmux'

cask 'sublime-text'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2-beta'
cask 'appcleaner'
cask 'spotify'
cask 'virtualbox'
cask 'spectacle'
cask 'java'
cask 'filezilla'
cask 'bartender'
cask 'flux'
cask 'postman'
cask 'grandperspective'
cask 'libreoffice'
cask 'transmission'
cask 'android-file-transfer'
cask 'vlc'
cask 'skyfonts'
cask 'dropbox'
cask 'franz'
cask 'adobe-creative-cloud'
cask 'discord'
cask 'slack'
cask 'etcher'

# fonts
cask 'font-source-code-pro'
cask 'font-hack'
